Revit 2024 API
LightType.GetInitialColor Method
 Return a copy of an object derived from InitialColor
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public InitialColor GetInitialColor()
Visual Basic
Public Function GetInitialColor As InitialColor
Visual C++
public:
InitialColor^ GetInitialColor()
See Also
LightType Class
Autodesk.Revit.DB.Lighting Namespace